# 01-Basic: Pandas essentials
For these exercises, we are going to be using the [Pandas](https://pandas.pydata.org/about/) Python package, so the first thing to do is to import Pandas. To do this, click on the code block below and press the 'Run' button to the left.

In [1]:
import pandas as pd

## Creating data
Pandas uses `DataFrame` to store and manipulate data. Run the code below to create a `DataFrame` using some simple test data. Here we have used the `head()` method to show (part of) the `DataFrame`.

In [2]:
df_test = pd.DataFrame(data=[['1',2,3.0],[4,'5',6],[0.07,88.0,999]],columns=['A','B','C'])
df_test.head()

      A     B      C
0     1     2    3.0
1     4     5    6.0
2  0.07  88.0  999.0

### Exercise-01: Heads and tails
Try running the above code with `head()` replaced by `head(1)`, `head(2)`, and `head(3)`, respectively. Similarly, try running the above code with `head()` replaced by `tail(1)`, `tail(2)`, and `tail(3)`, respectively. What do `head()` and `tail()` do?

## Saving data
Often it is useful to save data. For example, we can save the previous test data to a comma-separated values (`.csv`) file by running the following code. After you have run the code, identify *where* the file was saved (i.e. which folder?).

In [3]:
df_test.to_csv('./test.csv')

### Exercise-02: Parents and siblings
Sometimes we need to save/load data not in the current directory. Run the code below to save the same test data to two other locations. After you have run the code, identify *where* the files were saved.

In [4]:
df_test.to_csv('../test_parent.csv')
df_test.to_csv('../data/test_sibling.csv')

Before we move on, let's clean up the mess you made! Run the code below to remove the test `.csv` files we just created.

In [5]:
!rm ./test.csv
!rm ../test_parent.csv
!rm ../data/test_sibling.csv

(Note that the above code uses `!` to run terminal commands from inside a notebook!) Cool, no?

## Loading data
Ok, let's get started with some *real* data. To work with real data, we first need to load it. If the data is in a `.csv` file then we can load the data simply using the Pandas `read_csv` function. Run the code below to load the `listings_sample.csv` data into a Pandas `DataFrame`.

In [6]:
import pandas as pd
df_listings = pd.read_csv('../data/listings_sample.csv', 
    usecols=['host_id','id','name','room_type','price'])
df_listings.head()

,host_id,id,name,room_type,price
0,43039,11551,Arty and Bright London Apartment in Zone 2,Entire home/apt,$110.00
1,54730,13913,Holiday London DB Room Let-on going,Private room,$40.00
2,60302,15400,Bright Chelsea Apartment. Chelsea!,Entire home/apt,$75.00
3,67564,17402,Superb 3-Bed/2 Bath & Wifi: Trendy W1,Entire home/apt,$307.00
4,103583,25123,Clean big Room in London (Room 1),Private room,$29.00

The data you just loaded relates to real listings on [Airbnb](airbnb.com), sampled from a dataset from the [Inside Airbnb](http://insideairbnb.com/about.html) website. Note how the `usecols` argument was used to specify which columns of the data to load.

### Exercise-03: Load host data
Now it's time to try to load some data yourself. Using the code above as a guide, load the `hosts_sample.csv` file into a data-frame named `df_hosts` with columns `['id','host_name','host_since']`.

In [7]:
# (SOLUTION)
df_hosts = pd.read_csv('../data/hosts_sample.csv', usecols=['id','host_name','host_since'])
df_hosts.head()

         id host_name  host_since
0   43039.0   Adriano  2009-10-03
1   54730.0     Alina  2009-11-16
2   60302.0  Philippa  2009-12-05
3   67564.0       Liz  2010-01-04
4  103583.0     Grace  2010-04-05

## Preparing data
Often the data we load for analysis comes with values we cannot immediately work with, and we need to remove or format such (undefind) values to be able to do the analysis we want to do. 

For example, some of the hosts in `df_hosts` have undefind values in the `host_name` and/or `host_since` columns. We can see this by running the code below to show the rows in `df_hosts` where the value in `host_since` is `nan` (i.e. [not a number](https://en.wikipedia.org/wiki/NaN)).

In [8]:
df_hosts[df_hosts['host_since'].isna()].head()

            id host_name host_since
59    503548.0       NaN        NaN
93    761400.0       NaN        NaN
160  1436390.0       NaN        NaN
162  1438437.0       NaN        NaN
167  1467581.0       NaN        NaN

We can use similar logic to filter `df_hosts` (or any other `DataFrame`) to exclude any rows where a particulr column has value `nan`. For example, run the code below to remove `nan` values from `df_hosts`. Note the use of the `~` character to indicate we want to keep rows that are *not* `nan`.

In [9]:
df_hosts = df_hosts[~df_hosts['host_since'].isna()]
print(sum(df_hosts['host_since'].isna())) # Explain this check!

0

As well as undefined values, columns might also contain values in a format which is unsuitable for a particular type of analysis. For example, the values in the `host_since` column of `df_hosts` are [strings](https://www.w3schools.com/python/python_strings.asp) and would need to be formated if we wanted to calculate, for example, how long each host has been a host on Airbnb. Run the code below to use the `apply` method to do such a thing.

In [10]:
def host_years_old(host_since):
    return(2021 - int(host_since.split('-')[0]))

df_hosts['host_years_old'] = df_hosts['host_since'].apply(host_years_old)
df_hosts.head()

         id host_name  host_since  host_years_old
0   43039.0   Adriano  2009-10-03              12
1   54730.0     Alina  2009-11-16              12
2   60302.0  Philippa  2009-12-05              12
3   67564.0       Liz  2010-01-04              11
4  103583.0     Grace  2010-04-05              11

### Exercise-04: Format price data
The `price` column in `df_listings` also contains strings, with currency symbols (e.g.`$`) and commas (e.g. `1,000,000`), and we would need to format these string values to float values before we can use them in analysis. Using the above example as a guide, use the `format_price` function defined below to create a new column `price_$` in `df_listings` which contains a float value version of the price of the listing in $.

In [11]:
def format_price(price):
    return(float(price.replace('$','').replace(',','')))

# (SOLUTION)
df_listings['price_$'] = df_listings['price'].apply(format_price) 
df_listings[['price','price_$']].head()

     price  price_$
0  $110.00    110.0
1   $40.00     40.0
2   $75.00     75.0
3  $307.00    307.0
4   $29.00     29.0

## Querying data
Once we have loaded and formatted our data *then* the fun times begin! Pandas is great for *querying* `DataFrames` (i.e. filtering a `DataFrame` to create a new `DataFrame` which includes only the data we want!). For example, run the code below to use `df_hosts` to create a new `DataFrame` names `df_hosts_ancient` which contains hosts who have been hosts on Airbnb for more than 10 years.

In [12]:
df_hosts_ancient = df_hosts[df_hosts['host_years_old']>10]
df_hosts_ancient.head()

         id host_name  host_since  host_years_old
0   43039.0   Adriano  2009-10-03              12
1   54730.0     Alina  2009-11-16              12
2   60302.0  Philippa  2009-12-05              12
3   67564.0       Liz  2010-01-04              11
4  103583.0     Grace  2010-04-05              11

### Exercise-05: Identify budget listings
Using the above code as a guide, use `df_listings` to create a new `DataFrame` named `df_listings_budget` which contains listings whose price is less than $100.

In [13]:
# (SOLUTION)
df_listings_budget = df_listings[df_listings['price_$']<100]
df_listings_budget.head()

,host_id,id,name,room_type,price,price_$
1,54730,13913,Holiday London DB Room Let-on going,Private room,$40.00,40.0
2,60302,15400,Bright Chelsea Apartment. Chelsea!,Entire home/apt,$75.00,75.0
4,103583,25123,Clean big Room in London (Room 1),Private room,$29.00,29.0
5,144444,33332,Beautiful Ensuite Richmond-upon-Thames borough,Private room,$65.00,65.0
7,157884,36660,You are GUARANTEED to love this,Private room,$72.00,72.0

## Inspect the code
Have a play around with above code. If the notebooks breaks, then just restart it.

When you feel confident with the code in this notebook, then try `02-Advanced.ipynb`.

<a style='text-decoration:none;line-height:16px;display:flex;color:#5B5B62;padding:10px;justify-content:end;' href='https://deepnote.com?utm_source=created-in-deepnote-cell&projectId=2c6f047c-21a6-4149-814c-b3f60a9bf973' target="_blank">
<img alt='Created in deepnote.com' style='display:inline;max-height:16px;margin:0px;margin-right:7.5px;' src='' > </img>
Created in <span style='font-weight:600;margin-left:4px;'>Deepnote</span></a>